cancore/WICED-Studio-4.1/43xxx_Wi-Fi/WICED/platform/MCU/CYFM4/peripherals/libraries/devices/fm4/s6e2gmxj/common/s6e2gmxj.h
typedef struct stc_ethernet_mac_stnr_field
{
    union {
        struct {
            __IO  uint32_t  TSSS                 :31;
            __IO  uint32_t  RESERVED0            :1;
        };
        struct {
            __IO  uint32_t  TSSS0                :1;
            __IO  uint32_t  TSSS1                :1;
            __IO  uint32_t  TSSS2                :1;
            __IO  uint32_t  TSSS3                :1;
            __IO  uint32_t  TSSS4                :1;
            __IO  uint32_t  TSSS5                :1;
            __IO  uint32_t  TSSS6                :1;
            __IO  uint32_t  TSSS7                :1;
            __IO  uint32_t  TSSS8                :1;
            __IO  uint32_t  TSSS9                :1;
            __IO  uint32_t  TSSS10               :1;
            __IO  uint32_t  TSSS11               :1;
            __IO  uint32_t  TSSS12               :1;
            __IO  uint32_t  TSSS13               :1;
            __IO  uint32_t  TSSS14               :1;
            __IO  uint32_t  TSSS15               :1;
            __IO  uint32_t  TSSS16               :1;
            __IO  uint32_t  TSSS17               :1;
            __IO  uint32_t  TSSS18               :1;
            __IO  uint32_t  TSSS19               :1;
            __IO  uint32_t  TSSS20               :1;
            __IO  uint32_t  TSSS21               :1;
            __IO  uint32_t  TSSS22               :1;
            __IO  uint32_t  TSSS23               :1;
            __IO  uint32_t  TSSS24               :1;
            __IO  uint32_t  TSSS25               :1;
            __IO  uint32_t  TSSS26               :1;
            __IO  uint32_t  TSSS27               :1;
            __IO  uint32_t  TSSS28               :1;
            __IO  uint32_t  TSSS29               :1;
            __IO  uint32_t  TSSS30               :1;
            __IO  uint32_t  RESERVED1            :1;
        };
    };
} stc_ethernet_mac_stnr_field_t;

typedef struct stc_ethernet_mac_stsur_field
{
    union {
        struct {
            __IO  uint32_t  TSS                  :32;
        };
        struct {
            __IO  uint32_t  TSS0                 :1;
            __IO  uint32_t  TSS1                 :1;
            __IO  uint32_t  TSS2                 :1;
            __IO  uint32_t  TSS3                 :1;
            __IO  uint32_t  TSS4                 :1;
            __IO  uint32_t  TSS5                 :1;
            __IO  uint32_t  TSS6                 :1;
            __IO  uint32_t  TSS7                 :1;
            __IO  uint32_t  TSS8                 :1;
            __IO  uint32_t  TSS9                 :1;
            __IO  uint32_t  TSS10                :1;
            __IO  uint32_t  TSS11                :1;
            __IO  uint32_t  TSS12                :1;
            __IO  uint32_t  TSS13                :1;
            __IO  uint32_t  TSS14                :1;
            __IO  uint32_t  TSS15                :1;
            __IO  uint32_t  TSS16                :1;
            __IO  uint32_t  TSS17                :1;
            __IO  uint32_t  TSS18                :1;
            __IO  uint32_t  TSS19                :1;
            __IO  uint32_t  TSS20                :1;
            __IO  uint32_t  TSS21                :1;
            __IO  uint32_t  TSS22                :1;
            __IO  uint32_t  TSS23                :1;
            __IO  uint32_t  TSS24                :1;
            __IO  uint32_t  TSS25                :1;
            __IO  uint32_t  TSS26                :1;
            __IO  uint32_t  TSS27                :1;
            __IO  uint32_t  TSS28                :1;
            __IO  uint32_t  TSS29                :1;
            __IO  uint32_t  TSS30                :1;
            __IO  uint32_t  TSS31                :1;
        };
    };
} stc_ethernet_mac_stsur_field_t;

typedef struct stc_ethernet_mac_stnur_field
{
    union {
        struct {
            __IO  uint32_t  TSSS                 :31;
            __IO  uint32_t  ADDSUB               :1;
        };
        struct {
            __IO  uint32_t  TSSS0                :1;
            __IO  uint32_t  TSSS1                :1;
            __IO  uint32_t  TSSS2                :1;
            __IO  uint32_t  TSSS3                :1;
            __IO  uint32_t  TSSS4                :1;
            __IO  uint32_t  TSSS5                :1;
            __IO  uint32_t  TSSS6                :1;
            __IO  uint32_t  TSSS7                :1;
            __IO  uint32_t  TSSS8                :1;
            __IO  uint32_t  TSSS9                :1;
            __IO  uint32_t  TSSS10               :1;
            __IO  uint32_t  TSSS11               :1;
            __IO  uint32_t  TSSS12               :1;
            __IO  uint32_t  TSSS13               :1;
            __IO  uint32_t  TSSS14               :1;
            __IO  uint32_t  TSSS15               :1;
            __IO  uint32_t  TSSS16               :1;
            __IO  uint32_t  TSSS17               :1;
            __IO  uint32_t  TSSS18               :1;
            __IO  uint32_t  TSSS19               :1;
            __IO  uint32_t  TSSS20               :1;
            __IO  uint32_t  TSSS21               :1;
            __IO  uint32_t  TSSS22               :1;
            __IO  uint32_t  TSSS23               :1;
            __IO  uint32_t  TSSS24               :1;
            __IO  uint32_t  TSSS25               :1;
            __IO  uint32_t  TSSS26               :1;
            __IO  uint32_t  TSSS27               :1;
            __IO  uint32_t  TSSS28               :1;
            __IO  uint32_t  TSSS29               :1;
            __IO  uint32_t  TSSS30               :1;
            __IO  uint32_t  RESERVED0            :1;
        };
    };
} stc_ethernet_mac_stnur_field_t;

typedef struct stc_ethernet_mac_tsar_field
{
    union {
        struct {
            __IO  uint32_t  TSAR                 :32;
        };
        struct {
            __IO  uint32_t  TSAR0                :1;
            __IO  uint32_t  TSAR1                :1;
            __IO  uint32_t  TSAR2                :1;
            __IO  uint32_t  TSAR3                :1;
            __IO  uint32_t  TSAR4                :1;
            __IO  uint32_t  TSAR5                :1;
            __IO  uint32_t  TSAR6                :1;
            __IO  uint32_t  TSAR7                :1;
            __IO  uint32_t  TSAR8                :1;
            __IO  uint32_t  TSAR9                :1;
            __IO  uint32_t  TSAR10               :1;
            __IO  uint32_t  TSAR11               :1;
            __IO  uint32_t  TSAR12               :1;
            __IO  uint32_t  TSAR13               :1;
            __IO  uint32_t  TSAR14               :1;
            __IO  uint32_t  TSAR15               :1;
            __IO  uint32_t  TSAR16               :1;
            __IO  uint32_t  TSAR17               :1;
            __IO  uint32_t  TSAR18               :1;
            __IO  uint32_t  TSAR19               :1;
            __IO  uint32_t  TSAR20               :1;
            __IO  uint32_t  TSAR21               :1;
            __IO  uint32_t  TSAR22               :1;
            __IO  uint32_t  TSAR23               :1;
            __IO  uint32_t  TSAR24               :1;
            __IO  uint32_t  TSAR25               :1;
            __IO  uint32_t  TSAR26               :1;
            __IO  uint32_t  TSAR27               :1;
            __IO  uint32_t  TSAR28               :1;
            __IO  uint32_t  TSAR29               :1;
            __IO  uint32_t  TSAR30               :1;
            __IO  uint32_t  TSAR31               :1;
        };
    };
} stc_ethernet_mac_tsar_field_t;

typedef struct stc_ethernet_mac_ttsr_field
{
    union {
        struct {
            __IO  uint32_t  TSTR                 :32;
        };
        struct {
            __IO  uint32_t  TSTR0                :1;
            __IO  uint32_t  TSTR1                :1;
            __IO  uint32_t  TSTR2                :1;
            __IO  uint32_t  TSTR3                :1;
            __IO  uint32_t  TSTR4                :1;
            __IO  uint32_t  TSTR5                :1;
            __IO  uint32_t  TSTR6                :1;
            __IO  uint32_t  TSTR7                :1;
            __IO  uint32_t  TSTR8                :1;
            __IO  uint32_t  TSTR9                :1;
            __IO  uint32_t  TSTR10               :1;
            __IO  uint32_t  TSTR11               :1;
            __IO  uint32_t  TSTR12               :1;
            __IO  uint32_t  TSTR13               :1;
            __IO  uint32_t  TSTR14               :1;
            __IO  uint32_t  TSTR15               :1;
            __IO  uint32_t  TSTR16               :1;
            __IO  uint32_t  TSTR17               :1;
            __IO  uint32_t  TSTR18               :1;
            __IO  uint32_t  TSTR19               :1;
            __IO  uint32_t  TSTR20               :1;
            __IO  uint32_t  TSTR21               :1;
            __IO  uint32_t  TSTR22               :1;
            __IO  uint32_t  TSTR23               :1;
            __IO  uint32_t  TSTR24               :1;
            __IO  uint32_t  TSTR25               :1;
            __IO  uint32_t  TSTR26               :1;
            __IO  uint32_t  TSTR27               :1;
            __IO  uint32_t  TSTR28               :1;
            __IO  uint32_t  TSTR29               :1;
            __IO  uint32_t  TSTR30               :1;
            __IO  uint32_t  TSTR31               :1;
        };
    };
} stc_ethernet_mac_ttsr_field_t;

typedef struct stc_ethernet_mac_ttnr_field
{
    union {
        struct {
            __IO  uint32_t  TSTR                 :31;
            __IO  uint32_t  RESERVED0            :1;
        };
        struct {
            __IO  uint32_t  TSTR0                :1;
            __IO  uint32_t  TSTR1                :1;
            __IO  uint32_t  TSTR2                :1;
            __IO  uint32_t  TSTR3                :1;
            __IO  uint32_t  TSTR4                :1;
            __IO  uint32_t  TSTR5                :1;
            __IO  uint32_t  TSTR6                :1;
            __IO  uint32_t  TSTR7                :1;
            __IO  uint32_t  TSTR8                :1;
            __IO  uint32_t  TSTR9                :1;
            __IO  uint32_t  TSTR10               :1;
            __IO  uint32_t  TSTR11               :1;
            __IO  uint32_t  TSTR12               :1;
            __IO  uint32_t  TSTR13               :1;
            __IO  uint32_t  TSTR14               :1;
            __IO  uint32_t  TSTR15               :1;
            __IO  uint32_t  TSTR16               :1;
            __IO  uint32_t  TSTR17               :1;
            __IO  uint32_t  TSTR18               :1;
            __IO  uint32_t  TSTR19               :1;
            __IO  uint32_t  TSTR20               :1;
            __IO  uint32_t  TSTR21               :1;
            __IO  uint32_t  TSTR22               :1;
            __IO  uint32_t  TSTR23               :1;
            __IO  uint32_t  TSTR24               :1;
            __IO  uint32_t  TSTR25               :1;
            __IO  uint32_t  TSTR26               :1;
            __IO  uint32_t  TSTR27               :1;
            __IO  uint32_t  TSTR28               :1;
            __IO  uint32_t  TSTR29               :1;
            __IO  uint32_t  TSTR30               :1;
            __IO  uint32_t  RESERVED1            :1;
        };
    };
} stc_ethernet_mac_ttnr_field_t;

typedef struct stc_ethernet_mac_sthwsr_field
{
    union {
        struct {
            __IO  uint32_t  TSHWR                :16;
            __IO  uint32_t  RESERVED0            :16;
        };
        struct {
            __IO  uint32_t  TSHWR0               :1;
            __IO  uint32_t  TSHWR1               :1;
            __IO  uint32_t  TSHWR2               :1;
            __IO  uint32_t  TSHWR3               :1;
            __IO  uint32_t  TSHWR4               :1;
            __IO  uint32_t  TSHWR5               :1;
            __IO  uint32_t  TSHWR6               :1;
            __IO  uint32_t  TSHWR7               :1;
            __IO  uint32_t  TSHWR8               :1;
            __IO  uint32_t  TSHWR9               :1;
            __IO  uint32_t  TSHWR10              :1;
            __IO  uint32_t  TSHWR11              :1;
            __IO  uint32_t  TSHWR12              :1;
            __IO  uint32_t  TSHWR13              :1;
            __IO  uint32_t  TSHWR14              :1;
            __IO  uint32_t  TSHWR15              :1;
            __IO  uint32_t  RESERVED1            :16;
        };
    };
} stc_ethernet_mac_sthwsr_field_t;

typedef struct stc_ethernet_mac_tsr_field
{
    union {
        struct {
            __IO  uint32_t  TSSOVF               :1;
            __IO  uint32_t  TSTART               :1;
            __IO  uint32_t  ATSTS                :1;
            __IO  uint32_t  TRGTER               :1;
            __IO  uint32_t  RESERVED0            :20;
            __IO  uint32_t  ATSSTM               :1;
            __IO  uint32_t  ATSNS                :3;
            __IO  uint32_t  RESERVED2            :4;
        };
        struct {
            __IO  uint32_t  RESERVED1            :25;
            __IO  uint32_t  ATSNS0               :1;
            __IO  uint32_t  ATSNS1               :1;
            __IO  uint32_t  ATSNS2               :1;
            __IO  uint32_t  RESERVED3            :4;
        };
    };
} stc_ethernet_mac_tsr_field_t;

typedef struct stc_ethernet_mac_ppscr_field
{
    union {
        struct {
            __IO  uint32_t  PPSCTRL              :4;
            __IO  uint32_t  RESERVED0            :28;
        };
        struct {
            __IO  uint32_t  PPSCTRL0             :1;
            __IO  uint32_t  PPSCTRL1             :1;
            __IO  uint32_t  PPSCTRL2             :1;
            __IO  uint32_t  PPSCTRL3             :1;
            __IO  uint32_t  RESERVED1            :28;
        };
    };
} stc_ethernet_mac_ppscr_field_t;

typedef struct stc_ethernet_mac_atnr_field
{
    union {
        struct {
            __IO  uint32_t  ATN                  :31;
            __IO  uint32_t  RESERVED0            :1;
        };
        struct {
            __IO  uint32_t  ATN0                 :1;
            __IO  uint32_t  ATN1                 :1;
            __IO  uint32_t  ATN2                 :1;
            __IO  uint32_t  ATN3                 :1;
            __IO  uint32_t  ATN4                 :1;
            __IO  uint32_t  ATN5                 :1;
            __IO  uint32_t  ATN6                 :1;
            __IO  uint32_t  ATN7                 :1;
            __IO  uint32_t  ATN8                 :1;
            __IO  uint32_t  ATN9                 :1;
            __IO  uint32_t  ATN10                :1;
            __IO  uint32_t  ATN11                :1;
            __IO  uint32_t  ATN12                :1;
            __IO  uint32_t  ATN13                :1;
            __IO  uint32_t  ATN14                :1;
            __IO  uint32_t  ATN15                :1;
            __IO  uint32_t  ATN16                :1;
            __IO  uint32_t  ATN17                :1;
            __IO  uint32_t  ATN18                :1;
            __IO  uint32_t  ATN19                :1;
            __IO  uint32_t  ATN20                :1;
            __IO  uint32_t  ATN21                :1;
            __IO  uint32_t  ATN22                :1;
            __IO  uint32_t  ATN23                :1;
            __IO  uint32_t  ATN24                :1;
            __IO  uint32_t  ATN25                :1;
            __IO  uint32_t  ATN26                :1;
            __IO  uint32_t  ATN27                :1;
            __IO  uint32_t  ATN28                :1;
            __IO  uint32_t  ATN29                :1;
            __IO  uint32_t  ATN30                :1;
            __IO  uint32_t  RESERVED1            :1;
        };
    };
} stc_ethernet_mac_atnr_field_t;

typedef struct stc_ethernet_mac_atsr_field
{
    union {
        struct {
            __IO  uint32_t  ATS                  :32;
        };
        struct {
            __IO  uint32_t  ATS0                 :1;
            __IO  uint32_t  ATS1                 :1;
            __IO  uint32_t  ATS2                 :1;
            __IO  uint32_t  ATS3                 :1;
            __IO  uint32_t  ATS4                 :1;
            __IO  uint32_t  ATS5                 :1;
            __IO  uint32_t  ATS6                 :1;
            __IO  uint32_t  ATS7                 :1;
            __IO  uint32_t  ATS8                 :1;
            __IO  uint32_t  ATS9                 :1;
            __IO  uint32_t  ATS10                :1;
            __IO  uint32_t  ATS11                :1;
            __IO  uint32_t  ATS12                :1;
            __IO  uint32_t  ATS13                :1;
            __IO  uint32_t  ATS14                :1;
            __IO  uint32_t  ATS15                :1;
            __IO  uint32_t  ATS16                :1;
            __IO  uint32_t  ATS17                :1;
            __IO  uint32_t  ATS18                :1;
            __IO  uint32_t  ATS19                :1;
            __IO  uint32_t  ATS20                :1;
            __IO  uint32_t  ATS21                :1;
            __IO  uint32_t  ATS22                :1;
            __IO  uint32_t  ATS23                :1;
            __IO  uint32_t  ATS24                :1;
            __IO  uint32_t  ATS25                :1;
            __IO  uint32_t  ATS26                :1;
            __IO  uint32_t  ATS27                :1;
            __IO  uint32_t  ATS28                :1;
            __IO  uint32_t  ATS29                :1;
            __IO  uint32_t  ATS30                :1;
            __IO  uint32_t  ATS31                :1;
        };
    };
} stc_ethernet_mac_atsr_field_t;

typedef struct stc_ethernet_mac_mar16h_field
{
    union {
        struct {
            __IO  uint32_t  A                    :16;
            __IO  uint32_t  RESERVED0            :8;
            __IO  uint32_t  MBC                  :6;
            __IO  uint32_t  SA                   :1;
            __IO  uint32_t  AE                   :1;
        };
        struct {
            __IO  uint32_t  A0                   :1;
            __IO  uint32_t  A1                   :1;
            __IO  uint32_t  A2                   :1;
            __IO  uint32_t  A3                   :1;
            __IO  uint32_t  A4                   :1;
            __IO  uint32_t  A5                   :1;
            __IO  uint32_t  A6                   :1;
            __IO  uint32_t  A7                   :1;
            __IO  uint32_t  A8                   :1;
            __IO  uint32_t  A9                   :1;
            __IO  uint32_t  A10                  :1;
            __IO  uint32_t  A11                  :1;
            __IO  uint32_t  A12                  :1;
            __IO  uint32_t  A13                  :1;
            __IO  uint32_t  A14                  :1;
            __IO  uint32_t  A15                  :1;
            __IO  uint32_t  RESERVED1            :8;
            __IO  uint32_t  MBC0                 :1;
            __IO  uint32_t  MBC1                 :1;
            __IO  uint32_t  MBC2                 :1;
            __IO  uint32_t  MBC3                 :1;
            __IO  uint32_t  MBC4                 :1;
            __IO  uint32_t  MBC5                 :1;
            __IO  uint32_t  RESERVED2            :2;
        };
    };
} stc_ethernet_mac_mar16h_field_t;

