cancore/WICED-Studio-4.1/43xxx_Wi-Fi/WICED/platform/MCU/CYFM4/peripherals/libraries/devices/fm4/s6e2gmxj/common/s6e2gmxj.h
#define bFM_BT12_PWC_STC_OVIR                     *((volatile  uint8_t *)(0x424AC200UL))
#define bFM4_BT12_PWC_STC_OVIR                    *((volatile  uint8_t *)(0x424AC200UL))
#define bFM_BT12_PWC_STC_EDIR                     *((volatile  uint8_t *)(0x424AC208UL))
#define bFM4_BT12_PWC_STC_EDIR                    *((volatile  uint8_t *)(0x424AC208UL))
#define bFM_BT12_PWC_STC_OVIE                     *((volatile  uint8_t *)(0x424AC210UL))
#define bFM4_BT12_PWC_STC_OVIE                    *((volatile  uint8_t *)(0x424AC210UL))
#define bFM_BT12_PWC_STC_EDIE                     *((volatile  uint8_t *)(0x424AC218UL))
#define bFM4_BT12_PWC_STC_EDIE                    *((volatile  uint8_t *)(0x424AC218UL))
#define bFM_BT12_PWC_STC_ERR                      *((volatile  uint8_t *)(0x424AC21CUL))
#define bFM4_BT12_PWC_STC_ERR                     *((volatile  uint8_t *)(0x424AC21CUL))

#define bFM_BT12_PWC_TMCR_CTEN                    *((volatile  uint8_t *)(0x424AC184UL))
#define bFM4_BT12_PWC_TMCR_CTEN                   *((volatile  uint8_t *)(0x424AC184UL))
#define bFM_BT12_PWC_TMCR_MDSE                    *((volatile  uint8_t *)(0x424AC188UL))
#define bFM4_BT12_PWC_TMCR_MDSE                   *((volatile  uint8_t *)(0x424AC188UL))
#define bFM_BT12_PWC_TMCR_T32                     *((volatile  uint8_t *)(0x424AC19CUL))
#define bFM4_BT12_PWC_TMCR_T32                    *((volatile  uint8_t *)(0x424AC19CUL))

#define bFM_BT12_PWC_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424AC220UL))
#define bFM4_BT12_PWC_TMCR2_CKS3                  *((volatile  uint8_t *)(0x424AC220UL))

#define bFM_BT12_PWM_STC_UDIR                     *((volatile  uint8_t *)(0x424AC200UL))
#define bFM4_BT12_PWM_STC_UDIR                    *((volatile  uint8_t *)(0x424AC200UL))
#define bFM_BT12_PWM_STC_DTIR                     *((volatile  uint8_t *)(0x424AC204UL))
#define bFM4_BT12_PWM_STC_DTIR                    *((volatile  uint8_t *)(0x424AC204UL))
#define bFM_BT12_PWM_STC_TGIR                     *((volatile  uint8_t *)(0x424AC208UL))
#define bFM4_BT12_PWM_STC_TGIR                    *((volatile  uint8_t *)(0x424AC208UL))
#define bFM_BT12_PWM_STC_UDIE                     *((volatile  uint8_t *)(0x424AC210UL))
#define bFM4_BT12_PWM_STC_UDIE                    *((volatile  uint8_t *)(0x424AC210UL))
#define bFM_BT12_PWM_STC_DTIE                     *((volatile  uint8_t *)(0x424AC214UL))
#define bFM4_BT12_PWM_STC_DTIE                    *((volatile  uint8_t *)(0x424AC214UL))
#define bFM_BT12_PWM_STC_TGIE                     *((volatile  uint8_t *)(0x424AC218UL))
#define bFM4_BT12_PWM_STC_TGIE                    *((volatile  uint8_t *)(0x424AC218UL))

#define bFM_BT12_PWM_TMCR_STRG                    *((volatile  uint8_t *)(0x424AC180UL))
#define bFM4_BT12_PWM_TMCR_STRG                   *((volatile  uint8_t *)(0x424AC180UL))
#define bFM_BT12_PWM_TMCR_CTEN                    *((volatile  uint8_t *)(0x424AC184UL))
#define bFM4_BT12_PWM_TMCR_CTEN                   *((volatile  uint8_t *)(0x424AC184UL))
#define bFM_BT12_PWM_TMCR_MDSE                    *((volatile  uint8_t *)(0x424AC188UL))
#define bFM4_BT12_PWM_TMCR_MDSE                   *((volatile  uint8_t *)(0x424AC188UL))
#define bFM_BT12_PWM_TMCR_OSEL                    *((volatile  uint8_t *)(0x424AC18CUL))
#define bFM4_BT12_PWM_TMCR_OSEL                   *((volatile  uint8_t *)(0x424AC18CUL))
#define bFM_BT12_PWM_TMCR_PMSK                    *((volatile  uint8_t *)(0x424AC1A8UL))
#define bFM4_BT12_PWM_TMCR_PMSK                   *((volatile  uint8_t *)(0x424AC1A8UL))
#define bFM_BT12_PWM_TMCR_RTGEN                   *((volatile  uint8_t *)(0x424AC1ACUL))
#define bFM4_BT12_PWM_TMCR_RTGEN                  *((volatile  uint8_t *)(0x424AC1ACUL))

#define bFM_BT12_PWM_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424AC220UL))
#define bFM4_BT12_PWM_TMCR2_CKS3                  *((volatile  uint8_t *)(0x424AC220UL))

#define bFM_BT12_RT_STC_UDIR                      *((volatile  uint8_t *)(0x424AC200UL))
#define bFM4_BT12_RT_STC_UDIR                     *((volatile  uint8_t *)(0x424AC200UL))
#define bFM_BT12_RT_STC_TGIR                      *((volatile  uint8_t *)(0x424AC208UL))
#define bFM4_BT12_RT_STC_TGIR                     *((volatile  uint8_t *)(0x424AC208UL))
#define bFM_BT12_RT_STC_UDIE                      *((volatile  uint8_t *)(0x424AC210UL))
#define bFM4_BT12_RT_STC_UDIE                     *((volatile  uint8_t *)(0x424AC210UL))
#define bFM_BT12_RT_STC_TGIE                      *((volatile  uint8_t *)(0x424AC218UL))
#define bFM4_BT12_RT_STC_TGIE                     *((volatile  uint8_t *)(0x424AC218UL))

#define bFM_BT12_RT_TMCR_STRG                     *((volatile  uint8_t *)(0x424AC180UL))
#define bFM4_BT12_RT_TMCR_STRG                    *((volatile  uint8_t *)(0x424AC180UL))
#define bFM_BT12_RT_TMCR_CTEN                     *((volatile  uint8_t *)(0x424AC184UL))
#define bFM4_BT12_RT_TMCR_CTEN                    *((volatile  uint8_t *)(0x424AC184UL))
#define bFM_BT12_RT_TMCR_MDSE                     *((volatile  uint8_t *)(0x424AC188UL))
#define bFM4_BT12_RT_TMCR_MDSE                    *((volatile  uint8_t *)(0x424AC188UL))
#define bFM_BT12_RT_TMCR_OSEL                     *((volatile  uint8_t *)(0x424AC18CUL))
#define bFM4_BT12_RT_TMCR_OSEL                    *((volatile  uint8_t *)(0x424AC18CUL))
#define bFM_BT12_RT_TMCR_T32                      *((volatile  uint8_t *)(0x424AC19CUL))
#define bFM4_BT12_RT_TMCR_T32                     *((volatile  uint8_t *)(0x424AC19CUL))

#define bFM_BT12_RT_TMCR2_CKS3                    *((volatile  uint8_t *)(0x424AC220UL))
#define bFM4_BT12_RT_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424AC220UL))
#define bFM_BT12_RT_TMCR2_GATE                    *((volatile  uint8_t *)(0x424AC23CUL))
#define bFM4_BT12_RT_TMCR2_GATE                   *((volatile  uint8_t *)(0x424AC23CUL))


/*******************************************************************************
* BT Registers BT13
*   Bitband Section
*******************************************************************************/
#define bFM_BT13_PPG_STC_UDIR                     *((volatile  uint8_t *)(0x424ACA00UL))
#define bFM4_BT13_PPG_STC_UDIR                    *((volatile  uint8_t *)(0x424ACA00UL))
#define bFM_BT13_PPG_STC_TGIR                     *((volatile  uint8_t *)(0x424ACA08UL))
#define bFM4_BT13_PPG_STC_TGIR                    *((volatile  uint8_t *)(0x424ACA08UL))
#define bFM_BT13_PPG_STC_UDIE                     *((volatile  uint8_t *)(0x424ACA10UL))
#define bFM4_BT13_PPG_STC_UDIE                    *((volatile  uint8_t *)(0x424ACA10UL))
#define bFM_BT13_PPG_STC_TGIE                     *((volatile  uint8_t *)(0x424ACA18UL))
#define bFM4_BT13_PPG_STC_TGIE                    *((volatile  uint8_t *)(0x424ACA18UL))

#define bFM_BT13_PPG_TMCR_STRG                    *((volatile  uint8_t *)(0x424AC980UL))
#define bFM4_BT13_PPG_TMCR_STRG                   *((volatile  uint8_t *)(0x424AC980UL))
#define bFM_BT13_PPG_TMCR_CTEN                    *((volatile  uint8_t *)(0x424AC984UL))
#define bFM4_BT13_PPG_TMCR_CTEN                   *((volatile  uint8_t *)(0x424AC984UL))
#define bFM_BT13_PPG_TMCR_MDSE                    *((volatile  uint8_t *)(0x424AC988UL))
#define bFM4_BT13_PPG_TMCR_MDSE                   *((volatile  uint8_t *)(0x424AC988UL))
#define bFM_BT13_PPG_TMCR_OSEL                    *((volatile  uint8_t *)(0x424AC98CUL))
#define bFM4_BT13_PPG_TMCR_OSEL                   *((volatile  uint8_t *)(0x424AC98CUL))
#define bFM_BT13_PPG_TMCR_PMSK                    *((volatile  uint8_t *)(0x424AC9A8UL))
#define bFM4_BT13_PPG_TMCR_PMSK                   *((volatile  uint8_t *)(0x424AC9A8UL))
#define bFM_BT13_PPG_TMCR_RTGEN                   *((volatile  uint8_t *)(0x424AC9ACUL))
#define bFM4_BT13_PPG_TMCR_RTGEN                  *((volatile  uint8_t *)(0x424AC9ACUL))

#define bFM_BT13_PPG_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424ACA20UL))
#define bFM4_BT13_PPG_TMCR2_CKS3                  *((volatile  uint8_t *)(0x424ACA20UL))

