cancore/WICED-Studio-4.1/43xxx_Wi-Fi/WICED/platform/MCU/CYFM4/peripherals/libraries/devices/fm4/s6e2gmxj/common/s6e2gmxj.h
#define bFM_ETHERNET_MAC0_MAR18H_SA               *((volatile  uint8_t *)(0x42C90278UL))
#define bFM4_ETHERNET_MAC0_MAR18H_SA              *((volatile  uint8_t *)(0x42C90278UL))
#define bFM_ETHERNET_MAC0_MAR18H_AE               *((volatile  uint8_t *)(0x42C9027CUL))
#define bFM4_ETHERNET_MAC0_MAR18H_AE              *((volatile  uint8_t *)(0x42C9027CUL))

#define bFM_ETHERNET_MAC0_MAR19H_SA               *((volatile  uint8_t *)(0x42C90378UL))
#define bFM4_ETHERNET_MAC0_MAR19H_SA              *((volatile  uint8_t *)(0x42C90378UL))
#define bFM_ETHERNET_MAC0_MAR19H_AE               *((volatile  uint8_t *)(0x42C9037CUL))
#define bFM4_ETHERNET_MAC0_MAR19H_AE              *((volatile  uint8_t *)(0x42C9037CUL))

#define bFM_ETHERNET_MAC0_MAR1H_SA                *((volatile  uint8_t *)(0x42C80978UL))
#define bFM4_ETHERNET_MAC0_MAR1H_SA               *((volatile  uint8_t *)(0x42C80978UL))
#define bFM_ETHERNET_MAC0_MAR1H_AE                *((volatile  uint8_t *)(0x42C8097CUL))
#define bFM4_ETHERNET_MAC0_MAR1H_AE               *((volatile  uint8_t *)(0x42C8097CUL))

#define bFM_ETHERNET_MAC0_MAR20H_SA               *((volatile  uint8_t *)(0x42C90478UL))
#define bFM4_ETHERNET_MAC0_MAR20H_SA              *((volatile  uint8_t *)(0x42C90478UL))
#define bFM_ETHERNET_MAC0_MAR20H_AE               *((volatile  uint8_t *)(0x42C9047CUL))
#define bFM4_ETHERNET_MAC0_MAR20H_AE              *((volatile  uint8_t *)(0x42C9047CUL))

#define bFM_ETHERNET_MAC0_MAR21H_SA               *((volatile  uint8_t *)(0x42C90578UL))
#define bFM4_ETHERNET_MAC0_MAR21H_SA              *((volatile  uint8_t *)(0x42C90578UL))
#define bFM_ETHERNET_MAC0_MAR21H_AE               *((volatile  uint8_t *)(0x42C9057CUL))
#define bFM4_ETHERNET_MAC0_MAR21H_AE              *((volatile  uint8_t *)(0x42C9057CUL))

#define bFM_ETHERNET_MAC0_MAR22H_SA               *((volatile  uint8_t *)(0x42C90678UL))
#define bFM4_ETHERNET_MAC0_MAR22H_SA              *((volatile  uint8_t *)(0x42C90678UL))
#define bFM_ETHERNET_MAC0_MAR22H_AE               *((volatile  uint8_t *)(0x42C9067CUL))
#define bFM4_ETHERNET_MAC0_MAR22H_AE              *((volatile  uint8_t *)(0x42C9067CUL))

#define bFM_ETHERNET_MAC0_MAR23H_SA               *((volatile  uint8_t *)(0x42C90778UL))
#define bFM4_ETHERNET_MAC0_MAR23H_SA              *((volatile  uint8_t *)(0x42C90778UL))
#define bFM_ETHERNET_MAC0_MAR23H_AE               *((volatile  uint8_t *)(0x42C9077CUL))
#define bFM4_ETHERNET_MAC0_MAR23H_AE              *((volatile  uint8_t *)(0x42C9077CUL))

#define bFM_ETHERNET_MAC0_MAR24H_SA               *((volatile  uint8_t *)(0x42C90878UL))
#define bFM4_ETHERNET_MAC0_MAR24H_SA              *((volatile  uint8_t *)(0x42C90878UL))
#define bFM_ETHERNET_MAC0_MAR24H_AE               *((volatile  uint8_t *)(0x42C9087CUL))
#define bFM4_ETHERNET_MAC0_MAR24H_AE              *((volatile  uint8_t *)(0x42C9087CUL))

#define bFM_ETHERNET_MAC0_MAR25H_SA               *((volatile  uint8_t *)(0x42C90978UL))
#define bFM4_ETHERNET_MAC0_MAR25H_SA              *((volatile  uint8_t *)(0x42C90978UL))
#define bFM_ETHERNET_MAC0_MAR25H_AE               *((volatile  uint8_t *)(0x42C9097CUL))
#define bFM4_ETHERNET_MAC0_MAR25H_AE              *((volatile  uint8_t *)(0x42C9097CUL))

#define bFM_ETHERNET_MAC0_MAR26H_SA               *((volatile  uint8_t *)(0x42C90A78UL))
#define bFM4_ETHERNET_MAC0_MAR26H_SA              *((volatile  uint8_t *)(0x42C90A78UL))
#define bFM_ETHERNET_MAC0_MAR26H_AE               *((volatile  uint8_t *)(0x42C90A7CUL))
#define bFM4_ETHERNET_MAC0_MAR26H_AE              *((volatile  uint8_t *)(0x42C90A7CUL))

#define bFM_ETHERNET_MAC0_MAR27H_SA               *((volatile  uint8_t *)(0x42C90B78UL))
#define bFM4_ETHERNET_MAC0_MAR27H_SA              *((volatile  uint8_t *)(0x42C90B78UL))
#define bFM_ETHERNET_MAC0_MAR27H_AE               *((volatile  uint8_t *)(0x42C90B7CUL))
#define bFM4_ETHERNET_MAC0_MAR27H_AE              *((volatile  uint8_t *)(0x42C90B7CUL))

#define bFM_ETHERNET_MAC0_MAR28H_SA               *((volatile  uint8_t *)(0x42C90C78UL))
#define bFM4_ETHERNET_MAC0_MAR28H_SA              *((volatile  uint8_t *)(0x42C90C78UL))
#define bFM_ETHERNET_MAC0_MAR28H_AE               *((volatile  uint8_t *)(0x42C90C7CUL))
#define bFM4_ETHERNET_MAC0_MAR28H_AE              *((volatile  uint8_t *)(0x42C90C7CUL))

#define bFM_ETHERNET_MAC0_MAR29H_SA               *((volatile  uint8_t *)(0x42C90D78UL))
#define bFM4_ETHERNET_MAC0_MAR29H_SA              *((volatile  uint8_t *)(0x42C90D78UL))
#define bFM_ETHERNET_MAC0_MAR29H_AE               *((volatile  uint8_t *)(0x42C90D7CUL))
#define bFM4_ETHERNET_MAC0_MAR29H_AE              *((volatile  uint8_t *)(0x42C90D7CUL))

#define bFM_ETHERNET_MAC0_MAR2H_SA                *((volatile  uint8_t *)(0x42C80A78UL))
#define bFM4_ETHERNET_MAC0_MAR2H_SA               *((volatile  uint8_t *)(0x42C80A78UL))
#define bFM_ETHERNET_MAC0_MAR2H_AE                *((volatile  uint8_t *)(0x42C80A7CUL))
#define bFM4_ETHERNET_MAC0_MAR2H_AE               *((volatile  uint8_t *)(0x42C80A7CUL))

#define bFM_ETHERNET_MAC0_MAR30H_SA               *((volatile  uint8_t *)(0x42C90E78UL))
#define bFM4_ETHERNET_MAC0_MAR30H_SA              *((volatile  uint8_t *)(0x42C90E78UL))
#define bFM_ETHERNET_MAC0_MAR30H_AE               *((volatile  uint8_t *)(0x42C90E7CUL))
#define bFM4_ETHERNET_MAC0_MAR30H_AE              *((volatile  uint8_t *)(0x42C90E7CUL))

#define bFM_ETHERNET_MAC0_MAR31H_SA               *((volatile  uint8_t *)(0x42C90F78UL))
#define bFM4_ETHERNET_MAC0_MAR31H_SA              *((volatile  uint8_t *)(0x42C90F78UL))
#define bFM_ETHERNET_MAC0_MAR31H_AE               *((volatile  uint8_t *)(0x42C90F7CUL))
#define bFM4_ETHERNET_MAC0_MAR31H_AE              *((volatile  uint8_t *)(0x42C90F7CUL))

#define bFM_ETHERNET_MAC0_MAR3H_SA                *((volatile  uint8_t *)(0x42C80B78UL))
#define bFM4_ETHERNET_MAC0_MAR3H_SA               *((volatile  uint8_t *)(0x42C80B78UL))
#define bFM_ETHERNET_MAC0_MAR3H_AE                *((volatile  uint8_t *)(0x42C80B7CUL))
#define bFM4_ETHERNET_MAC0_MAR3H_AE               *((volatile  uint8_t *)(0x42C80B7CUL))

#define bFM_ETHERNET_MAC0_MAR4H_SA                *((volatile  uint8_t *)(0x42C80C78UL))
#define bFM4_ETHERNET_MAC0_MAR4H_SA               *((volatile  uint8_t *)(0x42C80C78UL))
#define bFM_ETHERNET_MAC0_MAR4H_AE                *((volatile  uint8_t *)(0x42C80C7CUL))
#define bFM4_ETHERNET_MAC0_MAR4H_AE               *((volatile  uint8_t *)(0x42C80C7CUL))

