cancore/WICED-Studio-4.1/43xxx_Wi-Fi/WICED/platform/MCU/CYFM4/peripherals/libraries/devices/fm4/s6e2gmxj/common/s6e2gmxj.h
#define bFM_MFT1_WFG_NZCL_DTIEA                   *((volatile  uint16_t*)(0x42423680UL))
#define bFM4_MFT1_WFG_NZCL_DTIEA                  *((volatile  uint16_t*)(0x42423680UL))
#define bFM_MFT1_WFG_NZCL_SDTI                    *((volatile  uint16_t*)(0x42423690UL))
#define bFM4_MFT1_WFG_NZCL_SDTI                   *((volatile  uint16_t*)(0x42423690UL))
#define bFM_MFT1_WFG_NZCL_DTIEB                   *((volatile  uint16_t*)(0x42423694UL))
#define bFM4_MFT1_WFG_NZCL_DTIEB                  *((volatile  uint16_t*)(0x42423694UL))
#define bFM_MFT1_WFG_NZCL_DHOLD                   *((volatile  uint16_t*)(0x4242369CUL))
#define bFM4_MFT1_WFG_NZCL_DHOLD                  *((volatile  uint16_t*)(0x4242369CUL))
#define bFM_MFT1_WFG_NZCL_DIMA                    *((volatile  uint16_t*)(0x424236A0UL))
#define bFM4_MFT1_WFG_NZCL_DIMA                   *((volatile  uint16_t*)(0x424236A0UL))
#define bFM_MFT1_WFG_NZCL_DIMB                    *((volatile  uint16_t*)(0x424236A4UL))
#define bFM4_MFT1_WFG_NZCL_DIMB                   *((volatile  uint16_t*)(0x424236A4UL))
#define bFM_MFT1_WFG_NZCL_WIM10                   *((volatile  uint16_t*)(0x424236B0UL))
#define bFM4_MFT1_WFG_NZCL_WIM10                  *((volatile  uint16_t*)(0x424236B0UL))
#define bFM_MFT1_WFG_NZCL_WIM32                   *((volatile  uint16_t*)(0x424236B4UL))
#define bFM4_MFT1_WFG_NZCL_WIM32                  *((volatile  uint16_t*)(0x424236B4UL))
#define bFM_MFT1_WFG_NZCL_WIM54                   *((volatile  uint16_t*)(0x424236B8UL))
#define bFM4_MFT1_WFG_NZCL_WIM54                  *((volatile  uint16_t*)(0x424236B8UL))

#define bFM_MFT1_WFG_WFIR_DTIFA                   *((volatile  uint16_t*)(0x42423600UL))
#define bFM4_MFT1_WFG_WFIR_DTIFA                  *((volatile  uint16_t*)(0x42423600UL))
#define bFM_MFT1_WFG_WFIR_DTICA                   *((volatile  uint16_t*)(0x42423604UL))
#define bFM4_MFT1_WFG_WFIR_DTICA                  *((volatile  uint16_t*)(0x42423604UL))
#define bFM_MFT1_WFG_WFIR_DTIFB                   *((volatile  uint16_t*)(0x42423608UL))
#define bFM4_MFT1_WFG_WFIR_DTIFB                  *((volatile  uint16_t*)(0x42423608UL))
#define bFM_MFT1_WFG_WFIR_DTICB                   *((volatile  uint16_t*)(0x4242360CUL))
#define bFM4_MFT1_WFG_WFIR_DTICB                  *((volatile  uint16_t*)(0x4242360CUL))
#define bFM_MFT1_WFG_WFIR_TMIF10                  *((volatile  uint16_t*)(0x42423610UL))
#define bFM4_MFT1_WFG_WFIR_TMIF10                 *((volatile  uint16_t*)(0x42423610UL))
#define bFM_MFT1_WFG_WFIR_TMIC10                  *((volatile  uint16_t*)(0x42423614UL))
#define bFM4_MFT1_WFG_WFIR_TMIC10                 *((volatile  uint16_t*)(0x42423614UL))
#define bFM_MFT1_WFG_WFIR_TMIE10                  *((volatile  uint16_t*)(0x42423618UL))
#define bFM4_MFT1_WFG_WFIR_TMIE10                 *((volatile  uint16_t*)(0x42423618UL))
#define bFM_MFT1_WFG_WFIR_TMIS10                  *((volatile  uint16_t*)(0x4242361CUL))
#define bFM4_MFT1_WFG_WFIR_TMIS10                 *((volatile  uint16_t*)(0x4242361CUL))
#define bFM_MFT1_WFG_WFIR_TMIF32                  *((volatile  uint16_t*)(0x42423620UL))
#define bFM4_MFT1_WFG_WFIR_TMIF32                 *((volatile  uint16_t*)(0x42423620UL))
#define bFM_MFT1_WFG_WFIR_TMIC32                  *((volatile  uint16_t*)(0x42423624UL))
#define bFM4_MFT1_WFG_WFIR_TMIC32                 *((volatile  uint16_t*)(0x42423624UL))
#define bFM_MFT1_WFG_WFIR_TMIE32                  *((volatile  uint16_t*)(0x42423628UL))
#define bFM4_MFT1_WFG_WFIR_TMIE32                 *((volatile  uint16_t*)(0x42423628UL))
#define bFM_MFT1_WFG_WFIR_TMIS32                  *((volatile  uint16_t*)(0x4242362CUL))
#define bFM4_MFT1_WFG_WFIR_TMIS32                 *((volatile  uint16_t*)(0x4242362CUL))
#define bFM_MFT1_WFG_WFIR_TMIF54                  *((volatile  uint16_t*)(0x42423630UL))
#define bFM4_MFT1_WFG_WFIR_TMIF54                 *((volatile  uint16_t*)(0x42423630UL))
#define bFM_MFT1_WFG_WFIR_TMIC54                  *((volatile  uint16_t*)(0x42423634UL))
#define bFM4_MFT1_WFG_WFIR_TMIC54                 *((volatile  uint16_t*)(0x42423634UL))
#define bFM_MFT1_WFG_WFIR_TMIE54                  *((volatile  uint16_t*)(0x42423638UL))
#define bFM4_MFT1_WFG_WFIR_TMIE54                 *((volatile  uint16_t*)(0x42423638UL))
#define bFM_MFT1_WFG_WFIR_TMIS54                  *((volatile  uint16_t*)(0x4242363CUL))
#define bFM4_MFT1_WFG_WFIR_TMIS54                 *((volatile  uint16_t*)(0x4242363CUL))


/*******************************************************************************
* QPRC Registers QPRC0
*   Bitband Section
*******************************************************************************/
#define bFM_QPRC0_QCR_PSTP                        *((volatile  uint8_t *)(0x424C0310UL))
#define bFM4_QPRC0_QCR_PSTP                       *((volatile  uint8_t *)(0x424C0310UL))
#define bFM_QPRC0_QCR_CGSC                        *((volatile  uint8_t *)(0x424C0314UL))
#define bFM4_QPRC0_QCR_CGSC                       *((volatile  uint8_t *)(0x424C0314UL))
#define bFM_QPRC0_QCR_RSEL                        *((volatile  uint8_t *)(0x424C0318UL))
#define bFM4_QPRC0_QCR_RSEL                       *((volatile  uint8_t *)(0x424C0318UL))
#define bFM_QPRC0_QCR_SWAP                        *((volatile  uint8_t *)(0x424C031CUL))
#define bFM4_QPRC0_QCR_SWAP                       *((volatile  uint8_t *)(0x424C031CUL))

#define bFM_QPRC0_QECR_ORNGMD                     *((volatile  uint8_t *)(0x424C0380UL))
#define bFM4_QPRC0_QECR_ORNGMD                    *((volatile  uint8_t *)(0x424C0380UL))
#define bFM_QPRC0_QECR_ORNGF                      *((volatile  uint8_t *)(0x424C0384UL))
#define bFM4_QPRC0_QECR_ORNGF                     *((volatile  uint8_t *)(0x424C0384UL))
#define bFM_QPRC0_QECR_ORNGIE                     *((volatile  uint8_t *)(0x424C0388UL))
#define bFM4_QPRC0_QECR_ORNGIE                    *((volatile  uint8_t *)(0x424C0388UL))
#define bFM_QPRC0_QECR_PEC                        *((volatile  uint8_t *)(0x424C038CUL))
#define bFM4_QPRC0_QECR_PEC                       *((volatile  uint8_t *)(0x424C038CUL))

